Revit 2027 API
Outline Properties
The Outline type exposes the following members.
Properties
Name | Description
IsEmpty |  Identifies if the outline represents an empty outline.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MaximumPoint |  The maximum point of the bounding box.
MinimumPoint |  The minimum point of the bounding box.
Top
See Also
Reference
Outline Class
Autodesk.Revit.DB Namespace